Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlopeZero Property
 Adjusting this Line's Overhang will not affect its height because its slope is zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlopeZero { get; }
Public Shared ReadOnly Property SlopeZero As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlopeZero {
	FailureDefinitionId^ get ();
}
static member SlopeZero : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace